In [1]:
import sqlite3

print(sqlite3.version)
print(sqlite3.sqlite_version)

2.6.0
3.37.0

## 1) Connect to the database.  In Memory in this case.

In [2]:
db = sqlite3.connect(':memory:')

## 2) Create a cursor to use to execute SQL statements.

In [3]:
cursor = db.cursor()

## 3) Use the cursor to execute SQL statements to the database.
Note:  We always execute a commit after the statement.

In [4]:
cursor.execute('''CREATE TABLE books(id INTEGER PRIMARY KEY, 
                   title TEXT, author TEXT, price TEXT, year TEXT)
''')
db.commit()

In [5]:
cursor.execute('''INSERT INTO books values (1, 'Pro PowerShell', 'Bryan Cafferky', 35.00, 2015)
''')
cursor.execute('''INSERT INTO books values (2, "'Hithiker's Guide to the Galaxy", 'Douglas Adams', 12.00, 199)
''')
db.commit()

In [6]:
lstbooks = cursor.execute('''select * from books;''').fetchall()
db.commit()
print(lstbooks)

[(1, 'Pro PowerShell', 'Bryan Cafferky', '35.0', '2015'), (2, "'Hithiker's Guide to the Galaxy", 'Douglas Adams', '12.0', '199')]

In [7]:
conn = sqlite3.connect("../data/chinook.db")
cur = conn.cursor()

albums = cur.execute("""select * from albums order by title limit 3;""").fetchall()
print(albums)

[(156, '...And Justice For All', 50), (257, '20th Century Masters - The Millennium Collection: The Best of Scorpions', 179), (296, 'A Copland Celebration, Vol. I', 230)]

In [8]:
type(albums)

list

In [10]:
import sqlite3
import pandas as pd

# convert query results to a dataframe

dfalbum = pd.read_sql_query("SELECT * FROM albums", conn)
dfalbum.head()

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

In [11]:
pd.read_sql_query("select name from sqlite_master where type = 'table';", conn)

               name
0            albums
1   sqlite_sequence
2           artists
3         customers
4         employees
5            genres
6          invoices
7     invoice_items
8       media_types
9         playlists
10   playlist_track
11           tracks
12     sqlite_stat1

In [12]:
dftablist = pd.read_sql_query("select name from sqlite_master where type = 'table';", conn)

In [13]:
dftablist.dtypes

name    object
dtype: object

In [14]:
dftablist

               name
0            albums
1   sqlite_sequence
2           artists
3         customers
4         employees
5            genres
6          invoices
7     invoice_items
8       media_types
9         playlists
10   playlist_track
11           tracks
12     sqlite_stat1

In [15]:
qry = '''
select substr(a.name, 1, 10) as Artist,
       substr(title,1, 15) as Album,
       t.name as Song
from albums r
join artists a
on (r.artistid = a.artistid)
join tracks t 
on (r.albumid = t.albumid)
order by a.name, title
limit 15;
'''

pd.read_sql_query(qry, conn, index_col = 'Artist')  # index_col replaces the default dataframe index

                  Album                                     Song
Artist
AC/DC   For Those About  For Those About To Rock (We Salute You)
AC/DC   For Those About                    Put The Finger On You
AC/DC   For Those About                          Let's Get It Up
AC/DC   For Those About                         Inject The Venom
AC/DC   For Those About                               Snowballed
AC/DC   For Those About                               Evil Walks
AC/DC   For Those About                                   C.O.D.
AC/DC   For Those About                       Breaking The Rules
AC/DC   For Those About                 Night Of The Long Knives
AC/DC   For Those About                               Spellbound
AC/DC   Let There Be Ro                                  Go Down
AC/DC   Let There Be Ro                              Dog Eat Dog
AC/DC   Let There Be Ro                        Let There Be Rock
AC/DC   Let There Be Ro                           Bad Boy Boogie
AC/DC   Let There Be Ro                            Problem Child

In [16]:
cur.close()
conn.close()

In [21]:
import psycopg2 as pg
import pandas.io.sql as psql
 
# get connected to the database
connection = pg.connect("dbname=Development user=bryan password=bryan")
 
df = pd.read_sql_query('select * from person',con=connection)

OperationalError: could not connect to server: No such file or directory
	Is the server running locally and accepting
	connections on Unix domain socket "/tmp/.s.PGSQL.5432"?